import { CategoryMessage } from "../types/category-message";

export const admissionCategoryMessages: CategoryMessage[] = [
  //1
  {
    message: "Які документи потрібні для вступу?",
    response:
      "Вступник, який подає заяву в електронній формі, під час реєстрації особистого електронного кабінету, зазначає такі дані: адресу електронної пошти, до якої має доступ (зазначена адреса буде логіном для входу до особистого електронного кабінету вступника), пароль для входу до особистого електронного кабінету, серію та номер документа (одного з документів) про раніше здобуту освіту (основу вступу), номер, PIN-код та рік отримання сертифіката зовнішнього незалежного оцінювання (сертифікат ЗНО) / сертифіката НМТ, тип та номер (серію та номер) документа, що посвідчує особу, або реєстраційний номер облікової картки платника податків (РНОКПП) (у разі відсутності сертифікатів ЗНО / сертифіката).",
    keywords: [
      "документи",
      "вступ",
      "заява",
      "освіта",
      "паспорт",
      "ідентифікаційний код",
      "фото",
      "медична довідка",
      "пільги",
    ],
    category: "admission",
  },
  //2
  {
    message: "Як подати документи онлайн?",
    response:
      'Для подання заяв в електронній формі потрібно зареєструвати особистий електронний кабінет на сайті   <a href="https://vstup.edbo.gov.ua/">Електронний кабінет</a>   (працює під час вступної кампанії). Реєстрація особистих електронних кабінетів вступника розпочинається з 1 липня.',
    keywords: [
      "онлайн",
      "подача",
      "документи",
      "електронна система",
      "приймальна комісія",
    ],
    category: "admission",
  },
  //3
  {
    message: "Які спеціальності можна обрати?",
    response:
      "У ХДУ пропонуються різноманітні спеціальності з гуманітарних, соціальних, технічних, природничих наук, інформатики та інших областей. Повний список спеціальностей доступний на сайті університету.",
    keywords: [
      "спеціальності",
      "обрати",
      "гуманітарні",
      "соціальні",
      "технічні",
      "науки",
      "інформатика",
    ],
    category: "admission",
  },
  //4
  {
    message: "Які терміни подачі документів?",
    response:
      "Терміни подачі документів для вступу оголошуються щороку та залежать від обраної форми навчання та спеціальності. Актуальну інформацію можна знайти на офіційному сайті університету або зателефонувавши до приймальної комісії.",
    keywords: ["терміни", "подача", "документи", "вступ"],
    category: "admission",
  },
  //5
  {
    message: "Які конкурсні предмети для вступу?",
    response:
      "Конкурсні предмети визначаються відповідно до спеціальності та освітньої програми. Як правило, це результати ЗНО з основних предметів, які мають відношення до обраної спеціальності. Специфіку можна уточнити на сайті університету в розділі вступної кампанії.",
    keywords: ["конкурсні", "предмети", "ЗНО", "вступ"],
    category: "admission",
  },
  //6
  {
    message: "Які є вимоги до середнього балу атестату?",
    response:
      "Мінімальний середній бал атестату, який необхідний для вступу, може змінюватися залежно від конкуренції та спеціальності. Рекомендуємо ознайомитися з вимогами актуальної вступної кампанії на сайті університету.",
    keywords: ["середній бал", "атестат", "вимоги"],
    category: "admission",
  },
  //7
  {
    message: "Як відбувається подача оригіналів документів?",
    response:
      "Подача оригіналів документів здійснюється в приймальну комісію університету особисто або через представника за довіреністю в установлені терміни. Для онлайн-подачі потрібно буде завантажити скан-копії через ваш особистий кабінет.",
    keywords: ["оригінали", "документи", "подача"],
    category: "admission",
  },
  //8
  {
    message: "Чи можливо вступити без ЗНО?",
    response:
      "Вступ без ЗНО можливий тільки на окремі форми навчання або в категорії осіб, які мають право на вступ без вступних випробувань відповідно до законодавства. Детальну інформацію можна отримати на сайті університету або в приймальній комісії.",
    keywords: ["без ЗНО", "вступ"],
    category: "admission",
  },
  //9
  {
    message: "Який прохідний бал для вступу?",
    response:
      "Прохідний бал варіюється в залежності від спеціальності та конкурсу у поточному році. Актуальну інформацію про прохідні бали можна знайти на офіційному сайті ХДУ в розділі 'Абітурієнтам'.",
    keywords: ["прохідний бал", "вступ", "конкурс"],
    category: "admission",
  },
  //10
  {
    message: "Як подати апеляцію на результати вступних іспитів?",
    response:
      "Якщо ви не згодні з результатами вступних іспитів, ви маєте право подати апеляцію в приймальну комісію в установлений період часу. Процедуру подання апеляції та необхідні документи можна знайти в розділі 'Абітурієнтам'.",
    keywords: ["апеляція", "іспити", "результати", "приймальна комісія"],
    category: "admission",
  },
  //11
  {
    message: "Які є квоти для пільгових категорій абітурієнтів?",
    response:
      "Університет передбачає квоти для вступу для окремих пільгових категорій абітурієнтів, таких як сироти, інваліди, учасники бойових дій та інші. Детальну інформацію про квоти та умови вступу можна отримати на сайті ХДУ.",
    keywords: ["квоти", "пільгові категорії", "абітурієнти", "умови вступу"],
    category: "admission",
  },
  //12
  {
    message: "Чи є в університеті підготовчі курси для абітурієнтів?",
    response:
      "Так, ХДУ пропонує підготовчі курси для майбутніх абітурієнтів, які бажають підготуватися до вступних іспитів чи підвищити рівень знань з певних дисциплін. Розклад та вартість курсів можна знайти на сайті університету або звернувшись безпосередньо до відділу підготовчих курсів.",
    keywords: ["підготовчі курси", "абітурієнти", "підготовка до іспитів"],
    category: "admission",
  },
  //13
  {
    message: "Чи можливий перехід з іншого ВНЗ?",
    response:
      "Перехід з іншого вищого навчального закладу можливий. Для цього необхідно подати відповідну заяву та надати академічну довідку з попереднього місця навчання. Деталі процедури переведення описані на сайті університету.",
    keywords: ["перехід", "інший ВНЗ", "академічна довідка", "переведення"],
    category: "admission",
  },
  //14
  {
    message: "Які умови проживання в гуртожитку?",
    response:
      "Умови проживання в гуртожитках ХДУ забезпечують комфортне і безпечне середовище для студентів. Гуртожитки обладнані необхідними зручностями. Детальніше про житло та порядок заселення можна дізнатися на сайті університету або безпосередньо в студентському містечку.",
    keywords: ["гуртожиток", "проживання", "умови", "заселення"],
    category: "admission",
  },
  //15
  {
    message: "Як оформити академічну відпустку?",
    response:
      "Академічну відпустку можна оформити з особистих або медичних причин. Для цього потрібно звернутися до деканату з відповідною заявою та пакетом необхідних документів. Процедура та умови оформлення академічної відпустки регламентуються правилами університету.",
    keywords: ["академічна відпустка", "оформлення", "деканат"],
    category: "admission",
  },
  //16
  {
    message: "Як подати заяву на бюджет?",
    response:
      "Подати заяву на бюджет можна через електронний кабінет абітурієнта під час реєстрації на вступ. Важливо відзначити відповідний пункт у формі заяви.",
    keywords: ["заява", "бюджет", "електронний кабінет", "реєстрація", "вступ"],
    category: "admission",
  },
];
