import { CategoryMessage } from "../types/category-message";

export const contactCategoryMessages: CategoryMessage[] = [
  //1
  {
    message: "Контакти факультету біології, географії і екології",
    response:
      "Декан факультету -  Пилипенко Ігор Олегович. Пошта - OZaharov@ksu.ks.ua . Контактні особи - Ганна +380660139405, Олексій +380995101702",
    keywords: ["біологія", "географія", "екологія"],
    category: "contacts",
  },
  //2
  {
    message: "Контакти приймальної комісії",
    response:
      "Фактична адреса: вул. Шевченка, 57, Івано-Франківськ, Івано-Франківська область, 76000, моб. тел. +38(096)-613-05-16, +380684462993 (viber, telegram), пошта - EntranceExamination@ksu.ks.ua",
    keywords: [
      "приймальна комісія",
      "подача",
      "електронна система",
      "приймальна комісія",
    ],
    category: "contacts",
  },
  //3
  {
    message: "Контакти педагогічного факультету",
    response:
      "Декан факультету - Петухова Любов Євгенівна. Пошта - nvoropay@ksu.ks.ua . Контактні особи - Наталія +380665358258.",
    keywords: ["педагогічний факультет", "Петухова", "Любов", "Євгенівна"],
    category: "contacts",
  },
  //4
  {
    message: "Контакти факультету бізнесу і права",
    response:
      "Декан факультету - Соловйов Андрій Ігорович. Пошта - fomenko@ksu.ks.ua . Контактні особи - Маргарита +380506581219 , Наталія +380958405523.",
    keywords: ["бізнес", "право", "факультет", "Соловйов"],
    category: "contacts",
  },
  //5
  {
    message:
      "Контакти факультету української й іноземної філології та журналістики",
    response:
      "Декан факультету - Гоштанар Ірина Вікторівна. Пошта - igoshtanar@ksu.ks.ua",
    keywords: ["журналістика", "іноземна філологія", "Гоштанар"],
    category: "contacts",
  },
  //6
  {
    message: "Контакти факультету фізичного виховання та спорту",
    response:
      "Декан факультету - Глухов Іван Геннадійович. Пошта - igluhov@ksu.ks.ua . Контактні особи - +380505387397.",
    keywords: ["фізичне виховання", "спорт", "Глухов"],
    category: "contacts",
  },
  //7
  {
    message: "Контакти факультету комп'ютерних наук, фізики та математики",
    response:
      "Декан факультету - Гончаренко Тетяна Леонідівна. Пошта - physmat@ksu.ks.ua, tgoncharenko@ksu.ks.ua, valko@ksu.ks.ua",
    keywords: ["комп'ютерні науки", "фізика", "математика", "Гончаренко"],
    category: "contacts",
  },
  //8
  {
    message: "Контакти факультету культури та мистецтв",
    response:
      "Декан факультету - Левченко Микола Григорович. Пошта - levchenko@ksu.ks.ua . Контактні особи - +380505172029.",
    keywords: ["культура", "мистецтво", "Левченко"],
    category: "contacts",
  },
  //9
  {
    message: "Контакти факультету  психології, історії та соціології",
    response:
      "Декан факультету - Шапошникова Ірина Василівна. Пошта - ishaposhnykova@ksu.ks.ua . Контактні особи - +380951882181.",
    keywords: ["факультет психології", "історія", "соціологія", "Шапошникова"],
    category: "contacts",
  },
  //10
  {
    message: "Контакти медичного факультету?",
    response:
      "Декан факультету - Головченко Ігор Валентинович. Пошта - igolovchenko@ksu.ks.ua .Контактні особи - +380661151349.",
    keywords: ["мед", "медичний", "Головченко", "медичний факультет"],
    category: "contacts",
  },
  //11
  {
    message: "Контакти офісу  роботи з іноземцями",
    response: "Пошта - sjagrowez@ksu.ks.ua.",
    keywords: ["іноземець", "іноземця", "переселенець"],
    category: "contacts",
  },
  //12
  {
    message: "Контакти відділу бухгалтерії",
    response:
      "Головний бухгалтер - Попова Ірина Михайлівна. Пошта - accountsdep@ksu.ks.ua",
    keywords: ["бухгалтерія", "гроші", "оплата за навчання"],
    category: "contacts",
  },
  //13
  {
    message: "Контакти Лемещук Олександр Ігорович",
    response:
      'Пошта - Olemeshchuk@ksu.ks.ua. <a href="https://goo.su/Xm7smsp ">Сторінка ХДУ</a> ',
    keywords: ["Лемещука", "Лемещук О.І"],
    category: "contacts",
  },
];
